In [3]:
import pandas as pd

In [4]:
# Lista
data = [['Juan',25],["Martha",19],["Pedro",20]]

In [5]:
df = pd.DataFrame(data,columns=["nombre","edad"])

In [6]:
df

   nombre  edad
0    Juan    25
1  Martha    19
2   Pedro    20

In [7]:
# Diccionario

data = {'Nombre':["Juan","Martha","Pedro"],
      'Edad':[20,30,40]}

In [8]:
df = pd.DataFrame(data)

In [9]:
df

   Nombre  Edad
0    Juan    20
1  Martha    30
2   Pedro    40

In [10]:
data = (('Juan',25),("Martha",19),("Pedro",20))

In [11]:
df = pd.DataFrame(data,columns=["nombre","edad"])

In [12]:
df

   nombre  edad
0    Juan    25
1  Martha    19
2   Pedro    20

In [13]:
df = pd.read_csv("../data/data",sep='|')

In [14]:
df = pd.read_csv("../data/data.csv")

In [15]:
df = pd.read_csv("../data/data_without_header",header=None,names=["nombre","edad","ciudad"])

In [16]:
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [17]:
df = pd.read_json("../data/data.json")

In [18]:
df.shape

(3, 3)

In [19]:
df[["nombre","edad"]]

  nombre  edad
0   Juan    25
1  María    30
2  Pedro    35

In [20]:
df.loc[[0,2]]

  nombre  edad   ciudad
0   Juan    25   Madrid
2  Pedro    35  Sevilla

In [21]:
df[df['edad']>30]

  nombre  edad   ciudad
2  Pedro    35  Sevilla

In [22]:
data = {
    'grupo':['A','B','A','B','A','B'],
    'valor':[10,15,25,12,27,33]
}
df = pd.DataFrame(data)

In [23]:
df

  grupo  valor
0     A     10
1     B     15
2     A     25
3     B     12
4     A     27
5     B     33

In [24]:
df.groupby('grupo').mean()

           valor
grupo
A      20.666667
B      20.000000

In [25]:
df.groupby('grupo').sum()

       valor
grupo
A         62
B         60

In [26]:
data = {
    'A':[1,2,None,4],
    'B':[None,2,3,6]
}
df = pd.DataFrame(data)

In [27]:
df

     A    B
0  1.0  NaN
1  2.0  2.0
2  NaN  3.0
3  4.0  6.0

In [28]:
import numpy as np

In [29]:
df

     A    B
0  1.0  NaN
1  2.0  2.0
2  NaN  3.0
3  4.0  6.0

In [30]:
df_lleno = df.fillna(value=0)

In [31]:
df_lleno

     A    B
0  1.0  0.0
1  2.0  2.0
2  0.0  3.0
3  4.0  6.0

In [32]:
df_sin_na = df.dropna()
df_sin_na

     A    B
1  2.0  2.0
3  4.0  6.0

In [33]:
def suma(a,b):
    return a+b

In [34]:
df['dobleA'] = df['A'].apply(lambda x: x**2)

In [35]:
def doble(x):
    return x*2

In [36]:
df['dobleB'] = df['B'].apply(doble)

In [37]:
df

     A    B  dobleA  dobleB
0  1.0  NaN     1.0     NaN
1  2.0  2.0     4.0     4.0
2  NaN  3.0     NaN     6.0
3  4.0  6.0    16.0    12.0

In [38]:
df['suma2'] = df.apply(lambda row: row['A'] + row['B'],axis=1)

In [39]:
df

     A    B  dobleA  dobleB  suma2
0  1.0  NaN     1.0     NaN    NaN
1  2.0  2.0     4.0     4.0    4.0
2  NaN  3.0     NaN     6.0    NaN
3  4.0  6.0    16.0    12.0   10.0